MAL-Organization/MAL/library/src/hspec/stm/stm32f7/mal_hspec_stm32f7_timer.c
/*
 * Copyright (c) 2018 Olivier Allaire
 *
 * This file is part of MAL.
 *
 * MAL is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * MAL is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with MAL.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "gpio/mal_gpio_definitions.h"
#include "timer/mal_timer.h"
#include "stm32f7/stm32f7xx_hal_gpio.h"
#include "mal_hspec_stm32f7_timer.h"
#include "stm32f7/stm32f7xx_hal_rcc.h"
#include "clock/mal_clock.h"
#include "stm32f7/stm32f7xx_hal_gpio_ex.h"
#include "mal_hspec_stm32f7_gpio.h"
#include "std/mal_math.h"

static IRQn_Type mal_hspec_stm32f7_timer_get_update_irq(mal_timer_e timer);
static mal_error_e mal_hspec_stm32f7_timer_get_input_clk(mal_timer_e timer, uint64_t *clock);
static mal_error_e mal_hspec_stm32f7_timer_common_init(mal_timer_e timer, mal_timer_s *handle);
static mal_error_e mal_hspec_stm32f7_timer_common_update_init(mal_timer_e timer, mal_timer_s *handle,
                                                              mal_hertz_t frequency, mal_hertz_t delta);
static mal_error_e mal_hspec_stm32f7_timer_get_channel(mal_timer_e timer, mal_gpio_port_e port, uint8_t pin,
                                                       uint32_t *channel);
static mal_error_e mal_hspec_stm32f7_timer_get_alternate(mal_timer_e timer, uint32_t *alternate);
static bool mal_hspec_stm32f7_timer_is_used(mal_timer_e timer);
static mal_error_e mal_hspec_stm32f7_timer_common_count_init(mal_timer_e timer, mal_timer_s *handle,
                                                             mal_hertz_t frequency);
static mal_error_e mal_hspec_stm32f7_timer_init_io(mal_timer_e timer, mal_gpio_port_e port, uint8_t pin);
static IRQn_Type mal_hspec_stm32f7_timer_get_compare_irq(mal_timer_e timer);

static const mal_timer_e valid_timers[] = {
    MAL_TIMER_1,
    MAL_TIMER_2,
    MAL_TIMER_3,
    MAL_TIMER_4,
    MAL_TIMER_5,
    MAL_TIMER_6,
    MAL_TIMER_7,
    MAL_TIMER_8,
    MAL_TIMER_9,
    MAL_TIMER_10,
    MAL_TIMER_11,
    MAL_TIMER_12,
    MAL_TIMER_13,
    MAL_TIMER_14
};

static mal_timer_s *timer1_handle;
static mal_timer_s *timer2_handle;
static mal_timer_s *timer3_handle;
static mal_timer_s *timer4_handle;
static mal_timer_s *timer5_handle;
static mal_timer_s *timer6_handle;
static mal_timer_s *timer7_handle;
static mal_timer_s *timer8_handle;
static mal_timer_s *timer9_handle;
static mal_timer_s *timer10_handle;
static mal_timer_s *timer11_handle;
static mal_timer_s *timer12_handle;
static mal_timer_s *timer13_handle;
static mal_timer_s *timer14_handle;

mal_error_e mal_timer_get_valid_timers(const mal_timer_e **timers, uint8_t *size) {
    *timers = valid_timers;
    *size = sizeof(valid_timers) / sizeof(mal_timer_e);
    return MAL_ERROR_OK;
}

static IRQn_Type mal_hspec_stm32f7_timer_get_update_irq(mal_timer_e timer) {
    switch (timer) {
        case MAL_TIMER_1:
        case MAL_TIMER_10:
            return TIM1_UP_TIM10_IRQn;
        case MAL_TIMER_2:
            return TIM2_IRQn;
        case MAL_TIMER_3:
            return TIM3_IRQn;
        case MAL_TIMER_4:
            return TIM4_IRQn;
        case MAL_TIMER_5:
            return TIM5_IRQn;
        case MAL_TIMER_6:
            return TIM6_DAC_IRQn;
        case MAL_TIMER_7:
            return TIM7_IRQn;
        case MAL_TIMER_8:
        case MAL_TIMER_13:
            return TIM8_UP_TIM13_IRQn;
        case MAL_TIMER_9:
            return TIM1_BRK_TIM9_IRQn;
        case MAL_TIMER_11:
            return TIM1_TRG_COM_TIM11_IRQn;
        case MAL_TIMER_12:
            return TIM8_BRK_TIM12_IRQn;
        case MAL_TIMER_14:
        default:
            return TIM8_TRG_COM_TIM14_IRQn;
    }
}

static IRQn_Type mal_hspec_stm32f7_timer_get_compare_irq(mal_timer_e timer) {
    switch (timer) {
        case MAL_TIMER_1:
            return TIM1_CC_IRQn;
        case MAL_TIMER_2:
            return TIM2_IRQn;
        case MAL_TIMER_3:
            return TIM3_IRQn;
        case MAL_TIMER_4:
            return TIM4_IRQn;
        case MAL_TIMER_5:
            return TIM5_IRQn;
        case MAL_TIMER_6:
            return TIM6_DAC_IRQn;
        case MAL_TIMER_7:
            return TIM7_IRQn;
        case MAL_TIMER_8:
            return TIM8_CC_IRQn;
        case MAL_TIMER_9:
            return TIM1_BRK_TIM9_IRQn;
        case MAL_TIMER_10:
            return TIM1_UP_TIM10_IRQn;
        case MAL_TIMER_11:
            return TIM1_TRG_COM_TIM11_IRQn;
        case MAL_TIMER_12:
            return TIM8_BRK_TIM12_IRQn;
        case MAL_TIMER_13:
            return TIM8_UP_TIM13_IRQn;
        case MAL_TIMER_14:
        default:
            return TIM8_TRG_COM_TIM14_IRQn;
    }
}

MAL_DEFS_INLINE void mal_timer_disable_interrupt(mal_timer_s *handle, mal_timer_interrupt_state_s *state) {
    state->active = (bool)NVIC_GetEnableIRQ(handle->irq);
    NVIC_DisableIRQ(handle->irq);
    __DSB();
    __ISB();
}

MAL_DEFS_INLINE void mal_timer_restore_interrupt(mal_timer_s *handle, mal_timer_interrupt_state_s *state) {
    if (state->active) {
        NVIC_EnableIRQ(handle->irq);
    }
}

mal_error_e mal_timer_get_resolution(mal_timer_e timer, uint8_t *resolution) {
    switch (timer) {
        case MAL_TIMER_1:
        case MAL_TIMER_3:
        case MAL_TIMER_4:
        case MAL_TIMER_6:
        case MAL_TIMER_7:
        case MAL_TIMER_8:
        case MAL_TIMER_9:
        case MAL_TIMER_10:
        case MAL_TIMER_11:
        case MAL_TIMER_12:
        case MAL_TIMER_13:
        case MAL_TIMER_14:
            *resolution = 16;
            break;
        case MAL_TIMER_2:
        case MAL_TIMER_5:
            *resolution = 32;
            break;
        default:
            return MAL_ERROR_HARDWARE_INVALID;
    }
    return MAL_ERROR_OK;
}

