MAL-Organization/MAL/library/src/hspec/stm/stm32f7/mal_hspec_stm32f7_timer.c
static mal_error_e mal_hspec_stm32f7_timer_get_input_clk(mal_timer_e timer, uint64_t *clock) {
    // Get clock configurations
    RCC_ClkInitTypeDef clock_config;
    uint32_t flash_latency;
    HAL_RCC_GetClockConfig(&clock_config, &flash_latency);
    // Get timer PCLK and apb prescaler
    uint64_t pclk;
    uint32_t apb_prescaler;
    switch (timer) {
        case MAL_TIMER_1:
        case MAL_TIMER_8:
        case MAL_TIMER_9:
        case MAL_TIMER_10:
        case MAL_TIMER_11:
            // Save as mHz
            pclk = (uint64_t)HAL_RCC_GetPCLK2Freq() * 1000ULL;
            apb_prescaler = clock_config.APB2CLKDivider;
            break;
        case MAL_TIMER_2:
        case MAL_TIMER_3:
        case MAL_TIMER_4:
        case MAL_TIMER_5:
        case MAL_TIMER_6:
        case MAL_TIMER_7:
        case MAL_TIMER_12:
        case MAL_TIMER_13:
        case MAL_TIMER_14:
            // Save as mHz
            pclk = (uint64_t)HAL_RCC_GetPCLK1Freq() * 1000ULL;
            apb_prescaler = clock_config.APB1CLKDivider;
            break;
        default:
            return MAL_ERROR_HARDWARE_INVALID;
    }
    // Get timer prescaler settings
    uint32_t rcc_tim_prescaler_mode = RCC->DCKCFGR1 & RCC_DCKCFGR1_DFSDM1SEL_Msk;
    // Get system clock
    mal_hertz_t system_clock = mal_clock_get_system_clock();
    uint64_t system_clock_value = MAL_TYPES_MAL_HERTZ_TO_MILLIHERTZ(system_clock);
    // Compute proper input value
    if (rcc_tim_prescaler_mode) {
        switch (apb_prescaler) {
            case RCC_HCLK_DIV1:
            case RCC_HCLK_DIV2:
            case RCC_HCLK_DIV4:
                *clock = system_clock_value;
                break;
            default:
                *clock = pclk * 4;
                break;
        }
    } else {
        if (RCC_HCLK_DIV1 == apb_prescaler) {
            *clock = pclk;
        } else {
            *clock = pclk * 2;
        }
    }

    return MAL_ERROR_OK;
}

static mal_error_e mal_hspec_stm32f7_timer_common_init(mal_timer_e timer, mal_timer_s *handle) {
    // Initialize clock and timer specific handles handles
    switch (timer) {
        case MAL_TIMER_1:
            __HAL_RCC_TIM1_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM1;
            timer1_handle = handle;
            break;
        case MAL_TIMER_2:
            __HAL_RCC_TIM2_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM2;
            timer2_handle = handle;
            break;
        case MAL_TIMER_3:
            __HAL_RCC_TIM3_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM3;
            timer3_handle = handle;
            break;
        case MAL_TIMER_4:
            __HAL_RCC_TIM4_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM4;
            timer4_handle = handle;
            break;
        case MAL_TIMER_5:
            __HAL_RCC_TIM5_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM5;
            timer5_handle = handle;
            break;
        case MAL_TIMER_6:
            __HAL_RCC_TIM6_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM6;
            timer6_handle = handle;
            break;
        case MAL_TIMER_7:
            __HAL_RCC_TIM7_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM7;
            timer7_handle = handle;
            break;
        case MAL_TIMER_8:
            __HAL_RCC_TIM8_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM8;
            timer8_handle = handle;
            break;
        case MAL_TIMER_9:
            __HAL_RCC_TIM9_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM9;
            timer9_handle = handle;
            break;
        case MAL_TIMER_10:
            __HAL_RCC_TIM10_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM10;
            timer10_handle = handle;
            break;
        case MAL_TIMER_11:
            __HAL_RCC_TIM11_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM11;
            timer11_handle = handle;
            break;
        case MAL_TIMER_12:
            __HAL_RCC_TIM12_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM12;
            timer12_handle = handle;
            break;
        case MAL_TIMER_13:
            __HAL_RCC_TIM13_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM13;
            timer13_handle = handle;
            break;
        case MAL_TIMER_14:
        default:
            __HAL_RCC_TIM14_CLK_ENABLE();
            handle->hal_timer_handle.Instance = TIM14;
            timer14_handle = handle;
            break;
    }
    // Save timer
    handle->timer = timer;

    return MAL_ERROR_OK;
}

static bool mal_hspec_stm32f7_timer_is_used(mal_timer_e timer) {
    mal_timer_s *local_handle;
    switch (timer) {
        case MAL_TIMER_1:
            local_handle = timer1_handle;
            break;
        case MAL_TIMER_2:
            local_handle = timer2_handle;
            break;
        case MAL_TIMER_3:
            local_handle = timer3_handle;
            break;
        case MAL_TIMER_4:
            local_handle = timer4_handle;
            break;
        case MAL_TIMER_5:
            local_handle = timer5_handle;
            break;
        case MAL_TIMER_6:
            local_handle = timer6_handle;
            break;
        case MAL_TIMER_7:
            local_handle = timer7_handle;
            break;
        case MAL_TIMER_8:
            local_handle = timer8_handle;
            break;
        case MAL_TIMER_9:
            local_handle = timer9_handle;
            break;
        case MAL_TIMER_10:
            local_handle = timer10_handle;
            break;
        case MAL_TIMER_11:
            local_handle = timer11_handle;
            break;
        case MAL_TIMER_12:
            local_handle = timer12_handle;
            break;
        case MAL_TIMER_13:
            local_handle = timer13_handle;
            break;
        case MAL_TIMER_14:
            local_handle = timer14_handle;
            break;
        default:
            return MAL_ERROR_HARDWARE_INVALID;
    }
    // Check if timer is already initialized
    if (NULL != local_handle) {
        return true;
    }
    return false;
}

