MAL-Organization/MAL/library/src/hspec/stm/stm32f7/mal_hspec_stm32f7_timer.c
static mal_error_e mal_hspec_stm32f7_timer_common_update_init(mal_timer_e timer, mal_timer_s *handle,
                                                              mal_hertz_t frequency, mal_hertz_t delta) {
    mal_error_e mal_result;
    // Check if timer is already initialized
    bool validate_parameters = mal_hspec_stm32f7_timer_is_used(timer);
    // Execute common initialization
    mal_result = mal_hspec_stm32f7_timer_common_init(timer, handle);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Get timer input clock
    uint64_t timer_frequency;
    mal_result = mal_hspec_stm32f7_timer_get_input_clk(timer, &timer_frequency);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Fetch mask to get max period
    uint64_t mask;
    mal_result = mal_timer_get_count_mask(timer, &mask);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Try to find proper settings for requested frequency
    uint64_t target_frequency = MAL_TYPES_MAL_HERTZ_TO_MILLIHERTZ(frequency);
    uint64_t target_delta = MAL_TYPES_MAL_HERTZ_TO_MILLIHERTZ(delta);
    uint32_t prescaler = 0;
    uint32_t period;
    bool found = false;
    uint64_t smallest_delta = UINT64_MAX;
    for (period = (uint32_t)mask; period > 0; period--) {
        for (prescaler = 1; prescaler <= (UINT16_MAX + 1); prescaler++) {
            uint64_t potential_frequency = timer_frequency / ((uint64_t)period * (uint64_t)prescaler);
            uint64_t actual_delta;
            if (potential_frequency >= target_frequency) {
                actual_delta = potential_frequency - target_frequency;
            } else {
                actual_delta = target_frequency - potential_frequency;
            }
            if (actual_delta <= target_delta) {
                found = true;
                break;
            } else {
                if (actual_delta < smallest_delta) {
                    smallest_delta = actual_delta;
                }
            }
            // If we get here and the potential frequency is smaller than the
            // target frequency, we can change the period as the potential
            // frequency is just gonna keep getting smaller if we continue
            if (potential_frequency < target_frequency) {
                break;
            }
        }
        if (found) {
            break;
        }
    }
    if (!found) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    // Remove one because register is 0 based.
    prescaler -= 1;
    // Validate or set
    if (validate_parameters) {
        if ((handle->hal_timer_handle.Init.Prescaler != prescaler) ||
            (handle->hal_timer_handle.Init.Period != period)) {
            return MAL_ERROR_HARDWARE_UNAVAILABLE;
        }
        return MAL_ERROR_ALREADY_INITIALIZED;
    } else {
        // Set timer
        handle->hal_timer_handle.Init.Prescaler = prescaler;
        handle->hal_timer_handle.Init.Period = period;
        handle->hal_timer_handle.Init.CounterMode = TIM_COUNTERMODE_UP;
        handle->hal_timer_handle.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
        handle->hal_timer_handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
        handle->hal_timer_handle.Init.RepetitionCounter = 0;
    }

    return MAL_ERROR_OK;
}

static mal_error_e mal_hspec_stm32f7_timer_common_count_init(mal_timer_e timer, mal_timer_s *handle,
                                                             mal_hertz_t frequency) {
    mal_error_e mal_result;
    // Check if timer is already initialized
    bool validate_parameters = mal_hspec_stm32f7_timer_is_used(timer);
    // Execute common initialization
    mal_result = mal_hspec_stm32f7_timer_common_init(timer, handle);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Get timer input clock
    uint64_t timer_frequency;
    mal_result = mal_hspec_stm32f7_timer_get_input_clk(timer, &timer_frequency);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Try to find proper settings for requested frequency
    uint64_t target_frequency = MAL_TYPES_MAL_HERTZ_TO_MILLIHERTZ(frequency);
    uint32_t prescaler = 0;
    bool found = false;
    for (prescaler = 1; prescaler <= (UINT16_MAX + 1); prescaler++) {
        uint64_t potential_frequency = timer_frequency / (uint64_t)prescaler;
        if (potential_frequency != target_frequency) {
            continue;
        }
        found = true;
        break;
    }
    if (!found) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    // Fetch mask to get max period
    uint64_t mask;
    mal_result = mal_timer_get_count_mask(timer, &mask);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Remove one because register is 0 based.
    prescaler -= 1;
    // Validate or set
    if (validate_parameters) {
        if ((handle->hal_timer_handle.Init.Prescaler != prescaler) ||
            (handle->hal_timer_handle.Init.Period != (uint32_t)mask)) {
            return MAL_ERROR_HARDWARE_UNAVAILABLE;
        }
        return MAL_ERROR_ALREADY_INITIALIZED;
    } else {
        handle->hal_timer_handle.Init.Prescaler = prescaler;
        handle->hal_timer_handle.Init.Period = (uint32_t)mask;
        handle->hal_timer_handle.Init.CounterMode = TIM_COUNTERMODE_UP;
        handle->hal_timer_handle.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
        handle->hal_timer_handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
        handle->hal_timer_handle.Init.RepetitionCounter = 0;
        handle->hal_timer_handle.Parent = handle;
    }

    return MAL_ERROR_OK;
}

mal_error_e mal_timer_init_task(mal_timer_init_task_s *init, mal_timer_s *handle) {
    mal_error_e mal_result;
    HAL_StatusTypeDef hal_result;
    // Common initialisation such as clock, local handles and more.
    mal_result = mal_hspec_stm32f7_timer_common_update_init(init->timer, handle, init->frequency, init->delta);
    if (MAL_ERROR_OK != mal_result && MAL_ERROR_ALREADY_INITIALIZED != mal_result) {
        return mal_result;
    }
    // Initialise timer in basic mode
    if (MAL_ERROR_ALREADY_INITIALIZED == mal_result) {
        if (MAL_HSPEC_STM32F7_TIMER_MODE_BASIC != handle->mode) {
            return MAL_ERROR_HARDWARE_UNAVAILABLE;
        }
    } else {
        hal_result = HAL_TIM_Base_Init(&handle->hal_timer_handle);
        if (HAL_OK != hal_result) {
            return MAL_ERROR_HARDWARE_INVALID;
        }
        handle->mode = MAL_HSPEC_STM32F7_TIMER_MODE_BASIC;
    }
    // Enable NVIC interrupt for timer
    handle->irq = mal_hspec_stm32f7_timer_get_update_irq(init->timer);
    NVIC_EnableIRQ(handle->irq);
    NVIC_SetPriority(handle->irq, 2); // Find a way to manage priorities for interrupts
    // Enable timer interrupt
    handle->task_callback = init->callback;
    handle->callback_handle = init->callback_handle;
    HAL_TIM_Base_Start_IT(&handle->hal_timer_handle);

    return MAL_ERROR_OK;
}

static mal_error_e mal_hspec_stm32f7_timer_get_channel(mal_timer_e timer, mal_gpio_port_e port, uint8_t pin,
                                                       uint32_t *channel) {
    switch (timer) {
        case MAL_TIMER_1:
            if ((MAL_GPIO_PORT_A == port && 7 == pin) ||
                (MAL_GPIO_PORT_E == port && 8 == pin) ||
                (MAL_GPIO_PORT_E == port && 9 == pin) ||
                (MAL_GPIO_PORT_B == port && 13 == pin) ||
                (MAL_GPIO_PORT_A == port && 8 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_B == port && 0 == pin) ||
                       (MAL_GPIO_PORT_E == port && 10 == pin) ||
                       (MAL_GPIO_PORT_E == port && 11 == pin) ||
                       (MAL_GPIO_PORT_B == port && 14 == pin) ||
                       (MAL_GPIO_PORT_A == port && 9 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_B == port && 1 == pin) ||
                       (MAL_GPIO_PORT_E == port && 12 == pin) ||
                       (MAL_GPIO_PORT_E == port && 13 == pin) ||
                       (MAL_GPIO_PORT_B == port && 15 == pin) ||
                       (MAL_GPIO_PORT_A == port && 10 == pin)) {
                *channel = TIM_CHANNEL_3;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_E == port && 14 == pin) ||
                       (MAL_GPIO_PORT_A == port && 11 == pin)) {
                *channel = TIM_CHANNEL_4;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_2:
            if ((MAL_GPIO_PORT_A == port && 0 == pin) ||
                (MAL_GPIO_PORT_A == port && 5 == pin) ||
                (MAL_GPIO_PORT_A == port && 15 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_A == port && 1 == pin) ||
                       (MAL_GPIO_PORT_B == port && 3 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_A == port && 2 == pin) ||
                       (MAL_GPIO_PORT_B == port && 10 == pin)) {
                *channel = TIM_CHANNEL_3;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_A == port && 3 == pin) ||
                       (MAL_GPIO_PORT_B == port && 11 == pin)) {
                *channel = TIM_CHANNEL_4;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_3:
            if ((MAL_GPIO_PORT_A == port && 6 == pin) ||
                (MAL_GPIO_PORT_C == port && 6 == pin) ||
                (MAL_GPIO_PORT_B == port && 4 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_A == port && 7 == pin) ||
                       (MAL_GPIO_PORT_C == port && 7 == pin) ||
                       (MAL_GPIO_PORT_B == port && 5 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_B == port && 0 == pin) ||
                       (MAL_GPIO_PORT_C == port && 8 == pin)) {
                *channel = TIM_CHANNEL_3;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_B == port && 1 == pin) ||
                       (MAL_GPIO_PORT_C == port && 9 == pin)) {
                *channel = TIM_CHANNEL_4;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_4:
            if ((MAL_GPIO_PORT_D == port && 12 == pin) ||
                (MAL_GPIO_PORT_B == port && 6 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_D == port && 13 == pin) ||
                       (MAL_GPIO_PORT_B == port && 7 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_D == port && 14 == pin)  ||
                       (MAL_GPIO_PORT_B == port && 8 == pin)) {
                *channel = TIM_CHANNEL_3;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_D == port && 15 == pin) ||
                       (MAL_GPIO_PORT_B == port && 9 == pin)) {
                *channel = TIM_CHANNEL_4;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_5:
            if ((MAL_GPIO_PORT_A == port && 0 == pin) ||
                (MAL_GPIO_PORT_H == port && 10 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_A == port && 1 == pin) ||
                       (MAL_GPIO_PORT_H == port && 11 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_A == port && 2 == pin) ||
                       (MAL_GPIO_PORT_H == port && 12 == pin)) {
                *channel = TIM_CHANNEL_3;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_A == port && 3 == pin) ||
                       (MAL_GPIO_PORT_I == port && 0 == pin)) {
                *channel = TIM_CHANNEL_4;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_8:
            if ((MAL_GPIO_PORT_A == port && 5 == pin) ||
                (MAL_GPIO_PORT_A == port && 7 == pin) ||
                (MAL_GPIO_PORT_C == port && 6 == pin) ||
                (MAL_GPIO_PORT_H == port && 13 == pin) ||
                (MAL_GPIO_PORT_I == port && 5 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_B == port && 0 == pin) ||
                       (MAL_GPIO_PORT_B == port && 14 == pin) ||
                       (MAL_GPIO_PORT_C == port && 7 == pin) ||
                       (MAL_GPIO_PORT_H == port && 14 == pin) ||
                       (MAL_GPIO_PORT_I == port && 6 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_B == port && 1 == pin) ||
                       (MAL_GPIO_PORT_B == port && 15 == pin) ||
                       (MAL_GPIO_PORT_C == port && 8 == pin) ||
                       (MAL_GPIO_PORT_H == port && 15 == pin) ||
                       (MAL_GPIO_PORT_I == port && 7 == pin)) {
                *channel = TIM_CHANNEL_3;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_C == port && 9 == pin) ||
                       (MAL_GPIO_PORT_I == port && 2 == pin)) {
                *channel = TIM_CHANNEL_4;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_9:
            if ((MAL_GPIO_PORT_E == port && 5 == pin) ||
                (MAL_GPIO_PORT_A == port && 2 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_E == port && 6 == pin) ||
                       (MAL_GPIO_PORT_A == port && 3 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_10:
            if ((MAL_GPIO_PORT_F == port && 6 == pin) ||
                (MAL_GPIO_PORT_B == port && 8 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_11:
            if ((MAL_GPIO_PORT_F == port && 7 == pin) ||
                (MAL_GPIO_PORT_B == port && 9 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_12:
            if ((MAL_GPIO_PORT_H == port && 6 == pin) ||
                (MAL_GPIO_PORT_B == port && 14 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else if ((MAL_GPIO_PORT_H == port && 9 == pin) ||
                       (MAL_GPIO_PORT_B == port && 15 == pin)) {
                *channel = TIM_CHANNEL_2;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_13:
            if ((MAL_GPIO_PORT_F == port && 8 == pin) ||
                (MAL_GPIO_PORT_A == port && 6 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        case MAL_TIMER_14:
            if ((MAL_GPIO_PORT_F == port && 9 == pin) ||
                (MAL_GPIO_PORT_A == port && 7 == pin)) {
                *channel = TIM_CHANNEL_1;
                return MAL_ERROR_OK;
            } else {
                return MAL_ERROR_HARDWARE_INVALID;
            }
        default:
            return MAL_ERROR_HARDWARE_INVALID;
    }
}

static mal_error_e mal_hspec_stm32f7_timer_get_alternate(mal_timer_e timer, uint32_t *alternate) {
    switch (timer) {
        case MAL_TIMER_1:
            *alternate = GPIO_AF1_TIM1;
            return MAL_ERROR_OK;
        case MAL_TIMER_2:
            *alternate = GPIO_AF1_TIM2;
            return MAL_ERROR_OK;
        case MAL_TIMER_3:
            *alternate = GPIO_AF2_TIM3;
            return MAL_ERROR_OK;
        case MAL_TIMER_4:
            *alternate = GPIO_AF2_TIM4;
            return MAL_ERROR_OK;
        case MAL_TIMER_5:
            *alternate = GPIO_AF2_TIM5;
            return MAL_ERROR_OK;
        case MAL_TIMER_8:
            *alternate = GPIO_AF3_TIM8;
            return MAL_ERROR_OK;
        case MAL_TIMER_9:
            *alternate = GPIO_AF3_TIM9;
            return MAL_ERROR_OK;
        case MAL_TIMER_10:
            *alternate = GPIO_AF3_TIM10;
            return MAL_ERROR_OK;
        case MAL_TIMER_11:
            *alternate = GPIO_AF3_TIM11;
            return MAL_ERROR_OK;
        case MAL_TIMER_12:
            *alternate = GPIO_AF9_TIM12;
            return MAL_ERROR_OK;
        case MAL_TIMER_13:
            *alternate = GPIO_AF9_TIM13;
            return MAL_ERROR_OK;
        case MAL_TIMER_14:
            *alternate = GPIO_AF9_TIM14;
            return MAL_ERROR_OK;
        default:
            return MAL_ERROR_HARDWARE_INVALID;
    }
}

mal_error_e mal_timer_init_pwm(mal_timer_init_pwm_s *init, mal_timer_s *handle, mal_timer_pwm_s *pwm_handle) {
    mal_error_e mal_result;
    HAL_StatusTypeDef hal_result;
    // Common initialisation such as clock, local handles and more.
    mal_error_e common_result;
    common_result = mal_hspec_stm32f7_timer_common_update_init(init->timer, handle, init->frequency, init->delta);
    if (MAL_ERROR_OK != common_result && MAL_ERROR_ALREADY_INITIALIZED != common_result) {
        return common_result;
    }
    // Initialize PWM IO
    mal_result = mal_hspec_stm32f7_timer_init_io(init->timer, init->port, init->pin);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Initialise timer in PWM mode
    if (MAL_ERROR_ALREADY_INITIALIZED == common_result) {
        if (MAL_HSPEC_STM32F7_TIMER_MODE_PWM != handle->mode) {
            return MAL_ERROR_HARDWARE_UNAVAILABLE;
        }
    } else {
        hal_result = HAL_TIM_PWM_Init(&handle->hal_timer_handle);
        if (HAL_OK != hal_result) {
            return MAL_ERROR_HARDWARE_INVALID;
        }
        handle->mode = MAL_HSPEC_STM32F7_TIMER_MODE_PWM;
    }
    // Set PWM handle
    pwm_handle->handle = handle;
    // Get channel
    mal_result = mal_hspec_stm32f7_timer_get_channel(init->timer, init->port, init->pin, &pwm_handle->channel);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Configure channel
    mal_result = mal_timer_set_pwm_duty_cycle(pwm_handle, MAL_TYPES_FLOAT_RATIO_TO_RATIO(0.0f, 1.0f));
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }

    return MAL_ERROR_OK;
}

mal_error_e mal_timer_set_pwm_duty_cycle(mal_timer_pwm_s *handle, mal_ratio_t duty_cycle) {
    HAL_StatusTypeDef hal_result;
    TIM_OC_InitTypeDef oc_config;
    // Stop PWM for update
    HAL_TIM_PWM_Stop(&handle->handle->hal_timer_handle, handle->channel);
    // Update config
    oc_config.OCMode = TIM_OCMODE_PWM1;
    oc_config.OCPolarity = TIM_OCPOLARITY_HIGH;
    oc_config.OCNPolarity = TIM_OCPOLARITY_HIGH;
    oc_config.OCIdleState = TIM_OCNIDLESTATE_RESET;
    oc_config.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    oc_config.OCFastMode = TIM_OCFAST_DISABLE;
    oc_config.Pulse = MAL_TYPES_RATIO_OF_INT_VALUE(duty_cycle, uint32_t,
            handle->handle->hal_timer_handle.Instance->ARR);
    hal_result = HAL_TIM_PWM_ConfigChannel(&handle->handle->hal_timer_handle, &oc_config, handle->channel);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    // Start PWM
    hal_result = HAL_TIM_PWM_Start(&handle->handle->hal_timer_handle, handle->channel);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    return MAL_ERROR_OK;
}

mal_error_e mal_timer_get_count_frequency(mal_timer_s *handle, mal_hertz_t *frequency) {
    mal_error_e result;
    // Get timer frequency
    uint64_t timer_frequency;
    result = mal_hspec_stm32f7_timer_get_input_clk(handle->timer, &timer_frequency);
    if (MAL_ERROR_OK != result) {
        return result;
    }
    // Compute frequency
    timer_frequency /= (handle->hal_timer_handle.Instance->PSC + 1);
    *frequency = MAL_TYPES_MILLIHERTZ_TO_MAL_HERTZ(timer_frequency);

    return MAL_ERROR_OK;
}

