MAL-Organization/MAL/library/src/hspec/stm/stm32f7/mal_hspec_stm32f7_timer.c
mal_error_e mal_timer_init_count(mal_timer_init_count_s *init, mal_timer_s *handle) {
    HAL_StatusTypeDef hal_result;
    // Execute common init
    mal_error_e common_result;
    common_result = mal_hspec_stm32f7_timer_common_count_init(init->timer, handle, init->frequency);
    if (MAL_ERROR_OK != common_result && MAL_ERROR_ALREADY_INITIALIZED != common_result) {
        return common_result;
    }
    // Initialise timer
    if (MAL_ERROR_ALREADY_INITIALIZED == common_result) {
        if (MAL_HSPEC_STM32F7_TIMER_MODE_COUNT != handle->mode) {
            return MAL_ERROR_HARDWARE_UNAVAILABLE;
        }
    } else {
        hal_result = HAL_TIM_Base_Init(&handle->hal_timer_handle);
        if (HAL_OK != hal_result) {
            return MAL_ERROR_HARDWARE_INVALID;
        }
        handle->mode = MAL_HSPEC_STM32F7_TIMER_MODE_COUNT;
    }
    hal_result = HAL_TIM_Base_Start(&handle->hal_timer_handle);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    return MAL_ERROR_OK;
}

static mal_error_e mal_hspec_stm32f7_timer_init_io(mal_timer_e timer, mal_gpio_port_e port, uint8_t pin) {
    mal_error_e mal_result;
    uint32_t alternate;
    mal_result = mal_hspec_stm32f7_timer_get_alternate(timer, &alternate);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    mal_result = mal_hspec_stm32f7_gpio_init_alternate(port, pin, alternate);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }

    return MAL_ERROR_OK;
}

mal_error_e mal_timer_init_input_capture(mal_timer_init_intput_capture_s *init, mal_timer_s *handle,
                                         mal_timer_input_capture_s *input_capture_handle) {
    mal_error_e mal_result;
    HAL_StatusTypeDef hal_result;
    // Common initialisation such as clock, local handles and more.
    mal_error_e common_result;
    common_result = mal_hspec_stm32f7_timer_common_count_init(init->timer, handle, init->frequency);
    if (MAL_ERROR_OK != common_result && MAL_ERROR_ALREADY_INITIALIZED != common_result) {
        return common_result;
    }
    // Initialize input capture IO
    mal_result = mal_hspec_stm32f7_timer_init_io(init->timer, init->port, init->pin);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Initialise timer in input capture mode
    if (MAL_ERROR_ALREADY_INITIALIZED == common_result) {
        if (MAL_HSPEC_STM32F7_TIMER_MODE_COUNT != handle->mode) {
            return MAL_ERROR_HARDWARE_UNAVAILABLE;
        }
    } else {
        hal_result = HAL_TIM_IC_Init(&handle->hal_timer_handle);
        if (HAL_OK != hal_result) {
            return MAL_ERROR_HARDWARE_INVALID;
        }
        handle->mode = MAL_HSPEC_STM32F7_TIMER_MODE_COUNT;
    }
    // Get channel index
    uint32_t channel;
    mal_result = mal_hspec_stm32f7_timer_get_channel(init->timer, init->port, init->pin, &channel);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    uint32_t channel_index = channel >> 2U;
    // Set input capture handle
    handle->input_capture_handles[channel_index] = input_capture_handle;
    input_capture_handle->handle = handle;
    input_capture_handle->callback = init->callback;
    input_capture_handle->callback_handle = init->callback_handle;
    // Configure channel
    TIM_IC_InitTypeDef ic_init;
    if (MAL_TIMER_INPUT_RISING == init->input_event) {
        ic_init.ICPolarity = TIM_ICPOLARITY_RISING;
    } else if (MAL_TIMER_INPUT_FALLING == init->input_event) {
        ic_init.ICPolarity = TIM_ICPOLARITY_FALLING;
    } else {
        ic_init.ICPolarity = TIM_ICPOLARITY_BOTHEDGE;
    }
    ic_init.ICSelection = TIM_ICSELECTION_DIRECTTI;
    switch (init->input_divider) {
        case 1:
            ic_init.ICPrescaler = TIM_ICPSC_DIV1;
            break;
        case 2:
            ic_init.ICPrescaler = TIM_ICPSC_DIV2;
            break;
        case 4:
            ic_init.ICPrescaler = TIM_ICPSC_DIV4;
            break;
        case 8:
            ic_init.ICPrescaler = TIM_ICPSC_DIV8;
            break;
        default:
            return MAL_ERROR_HARDWARE_INVALID;
    }
    ic_init.ICFilter = 0;
    hal_result = HAL_TIM_IC_ConfigChannel(&handle->hal_timer_handle, &ic_init, channel);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    // Enable NVIC interrupt for timer
    handle->irq = mal_hspec_stm32f7_timer_get_compare_irq(init->timer);
    NVIC_EnableIRQ(handle->irq);
    NVIC_SetPriority(handle->irq, 2); // Find a way to manage priorities for interrupts
    // Start timer
    HAL_TIM_IC_Start_IT(&handle->hal_timer_handle, channel);

    return MAL_ERROR_OK;
}

mal_error_e mal_timer_init_input_count(mal_timer_init_count_input_s *init, mal_timer_s *handle) {
    mal_error_e mal_result;
    HAL_StatusTypeDef hal_result;
    // Execute common initialization
    mal_result = mal_hspec_stm32f7_timer_common_init(init->timer, handle);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Initialize input
    mal_result = mal_hspec_stm32f7_timer_init_io(init->timer, init->port, init->pin);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Get timer input clock
    uint64_t timer_frequency;
    mal_result = mal_hspec_stm32f7_timer_get_input_clk(init->timer, &timer_frequency);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // This frequency is in mHz, bring this back to Hz
    timer_frequency /= 1000;
    if (timer_frequency <= 0) {
        return MAL_ERROR_OPERATION_INVALID;
    }
    // Determine pulse length
    float maximum_frequency = MAL_TYPES_MAL_HERTZ_TO_HERTZ(init->maximum_frequency);
    if (0.0f == maximum_frequency) {
        return MAL_ERROR_OPERATION_INVALID;
    }
    float minimum_period = 1.0f / maximum_frequency;
    float duty_cycle = (float)init->duty_cycle / (float)MAL_TYPES_RATIO_NORMALIZER;
    float smallest_cycle = duty_cycle;
    if (smallest_cycle > 0.5f) {
        smallest_cycle = 1.0f - duty_cycle;
    }
    // The 0.5 is to leave some margin. Maybe this could be a parameter later on?
    float pulse_length = smallest_cycle * minimum_period * 0.5f;
    // Find the proper filter values
    TIM_ClockConfigTypeDef clock_config;
    clock_config.ClockFilter = 0;
    handle->hal_timer_handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    uint32_t clock_prescaler_shift;
    float timer_period = 1.0f / (float)timer_frequency;
    float smallest_diff = MAXFLOAT;
    for (clock_prescaler_shift = 0;clock_prescaler_shift <= 2; clock_prescaler_shift++) {
        // Compute fdts period
        uint32_t clock_prescaler = (uint32_t)1 << clock_prescaler_shift;
        float fdts_period = timer_period * (float)clock_prescaler;
        uint32_t filter;
        for (filter = 0; filter <= 15; filter++) {
            // Determine filtering clock source
            float filtering_period = timer_period;
            if ((filter > 3) || (0 == filter)) {
                filtering_period = fdts_period;
            }
            // Determine filtering frequency prescaler
            float filtering_prescaler;
            switch (filter) {
                case 0:
                case 1:
                case 2:
                case 3:
                    filtering_prescaler = 1.0f;
                    break;
                case 4:
                case 5:
                    filtering_prescaler = 2.0f;
                    break;
                case 6:
                case 7:
                    filtering_prescaler = 4.0f;
                    break;
                case 8:
                case 9:
                    filtering_prescaler = 8.0f;
                    break;
                case 10:
                case 11:
                case 12:
                    filtering_prescaler = 16.0f;
                    break;
                default:
                    filtering_prescaler = 32.0f;
                    break;
            }
            // Determine filtering period multiple
            float filtering_period_multiple;
            switch (filter) {
                case 0:
                    filtering_period_multiple = 1.0f;
                    break;
                case 1:
                    filtering_period_multiple = 2.0f;
                    break;
                case 2:
                    filtering_period_multiple = 4.0f;
                    break;
                case 10:
                case 13:
                    filtering_period_multiple = 5.0f;
                    break;
                case 4:
                case 6:
                case 8:
                case 11:
                case 14:
                    filtering_period_multiple = 6.0f;
                    break;
                default:
                    filtering_period_multiple = 8.0f;
                    break;
            }
            // Finally, compute minimum pulse length that will be allowed through the filter
            float minimum_event_time = filtering_period * filtering_prescaler * filtering_period_multiple;
            // Check if filter event is too big
            if (minimum_event_time >= pulse_length) {
                continue;
            }
            // Check if this is the best filter setting
            float diff = pulse_length - minimum_event_time;
            if (diff >= smallest_diff) {
                continue;
            }
            smallest_diff = diff;
            // A possible config found
            clock_config.ClockFilter = filter;
            switch (clock_prescaler_shift) {
                case 0:
                    handle->hal_timer_handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
                    break;
                case 1:
                    handle->hal_timer_handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV2;
                    break;
                default:
                    handle->hal_timer_handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV4;
                    break;
            }
        }
    }
    // Get timer channel
    uint32_t timer_channel;
    mal_result = mal_hspec_stm32f7_timer_get_channel(init->timer, init->port, init->pin, &timer_channel);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Configure clock source
    if (TIM_CHANNEL_1 == timer_channel) {
        clock_config.ClockSource = TIM_CLOCKSOURCE_TI1;
    } else if (TIM_CHANNEL_2 == timer_channel) {
        clock_config.ClockSource = TIM_CLOCKSOURCE_TI2;
    } else {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    clock_config.ClockPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
    clock_config.ClockPrescaler = TIM_CLOCKPRESCALER_DIV1;
    TIM_TI1_SetConfig(handle->hal_timer_handle.Instance, TIM_ICPOLARITY_RISING, TIM_ICSELECTION_DIRECTTI,
                      clock_config.ClockFilter);
    hal_result = HAL_TIM_ConfigClockSource(&handle->hal_timer_handle, &clock_config);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_INIT_FAILED;
    }
    // Fetch mask to get max period
    uint64_t mask;
    mal_result = mal_timer_get_count_mask(init->timer, &mask);
    if (MAL_ERROR_OK != mal_result) {
        return mal_result;
    }
    // Initialise timer
    handle->hal_timer_handle.Init.Prescaler = 0;
    handle->hal_timer_handle.Init.Period = (uint32_t)mask;
    handle->hal_timer_handle.Init.CounterMode = TIM_COUNTERMODE_UP;
    handle->hal_timer_handle.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    handle->hal_timer_handle.Init.RepetitionCounter = 0;
    handle->hal_timer_handle.Parent = handle;
    hal_result = HAL_TIM_Base_Init(&handle->hal_timer_handle);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    handle->mode = MAL_HSPEC_STM32F7_TIMER_MODE_COUNT;
    hal_result = HAL_TIM_Base_Start(&handle->hal_timer_handle);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_HARDWARE_INVALID;
    }

    return MAL_ERROR_OK;
}

