MAL-Organization/MAL/library/src/hspec/stm/stm32f7/mal_hspec_stm32f7_timer.c
mal_error_e mal_timer_get_count(mal_timer_s *handle, uint64_t *count) {
    *count = handle->hal_timer_handle.Instance->CNT;
    return MAL_ERROR_OK;
}

mal_error_e mal_timer_free(mal_timer_s *handle) {
    HAL_StatusTypeDef hal_result;
    // Make sure timer is used
    if (!mal_hspec_stm32f7_timer_is_used(handle->timer)) {
        return MAL_ERROR_OPERATION_INVALID;
    }
    // Disable interrupt
    mal_timer_disable_interrupt(handle, NULL);
    // Disable timer
    hal_result = HAL_TIM_Base_DeInit(&handle->hal_timer_handle);
    if (HAL_OK != hal_result) {
        return MAL_ERROR_HARDWARE_INVALID;
    }
    // Reset peripheral
    switch (handle->timer) {
        case MAL_TIMER_1:
            __HAL_RCC_TIM1_FORCE_RESET();
            timer1_handle = NULL;
            break;
        case MAL_TIMER_2:
            __HAL_RCC_TIM2_FORCE_RESET();
            timer2_handle = NULL;
            break;
        case MAL_TIMER_3:
            __HAL_RCC_TIM3_FORCE_RESET();
            timer3_handle = NULL;
            break;
        case MAL_TIMER_4:
            __HAL_RCC_TIM4_FORCE_RESET();
            timer4_handle = NULL;
            break;
        case MAL_TIMER_5:
            __HAL_RCC_TIM5_FORCE_RESET();
            timer5_handle = NULL;
            break;
        case MAL_TIMER_6:
            __HAL_RCC_TIM6_FORCE_RESET();
            timer6_handle = NULL;
            break;
        case MAL_TIMER_7:
            __HAL_RCC_TIM7_FORCE_RESET();
            timer7_handle = NULL;
            break;
        case MAL_TIMER_8:
            __HAL_RCC_TIM8_FORCE_RESET();
            timer8_handle = NULL;
            break;
        case MAL_TIMER_9:
            __HAL_RCC_TIM9_FORCE_RESET();
            timer9_handle = NULL;
            break;
        case MAL_TIMER_10:
            __HAL_RCC_TIM10_FORCE_RESET();
            timer10_handle = NULL;
            break;
        case MAL_TIMER_11:
            __HAL_RCC_TIM11_FORCE_RESET();
            timer11_handle = NULL;
            break;
        case MAL_TIMER_12:
            __HAL_RCC_TIM12_FORCE_RESET();
            timer12_handle = NULL;
            break;
        case MAL_TIMER_13:
            __HAL_RCC_TIM13_FORCE_RESET();
            timer13_handle = NULL;
            break;
        case MAL_TIMER_14:
            __HAL_RCC_TIM14_FORCE_RESET();
            timer14_handle = NULL;
            break;
        default:
            return MAL_ERROR_OPERATION_INVALID;
    }
    // Flush handles
    handle->input_capture_handles[0] = NULL;
    handle->input_capture_handles[1] = NULL;
    handle->input_capture_handles[2] = NULL;
    handle->input_capture_handles[3] = NULL;
    handle->callback_handle = NULL;

    return MAL_ERROR_OK;
}

void TIM1_BRK_TIM9_IRQHandler(void) {
    if (NULL != timer1_handle) {
        HAL_TIM_IRQHandler(&timer1_handle->hal_timer_handle);
    }
    if (NULL != timer9_handle) {
        HAL_TIM_IRQHandler(&timer9_handle->hal_timer_handle);
    }
}

void TIM1_UP_TIM10_IRQHandler(void) {
    if (NULL != timer1_handle) {
        HAL_TIM_IRQHandler(&timer1_handle->hal_timer_handle);
    }
    if (NULL != timer10_handle) {
        HAL_TIM_IRQHandler(&timer10_handle->hal_timer_handle);
    }
}

void TIM1_TRG_COM_TIM11_IRQHandler(void) {
    if (NULL != timer1_handle) {
        HAL_TIM_IRQHandler(&timer1_handle->hal_timer_handle);
    }
    if (NULL != timer11_handle) {
        HAL_TIM_IRQHandler(&timer11_handle->hal_timer_handle);
    }
}

void TIM1_CC_IRQHandler(void) {
    if (NULL != timer1_handle) {
        HAL_TIM_IRQHandler(&timer1_handle->hal_timer_handle);
    }
}

void TIM2_IRQHandler(void) {
    if (NULL != timer2_handle) {
        HAL_TIM_IRQHandler(&timer2_handle->hal_timer_handle);
    }
}

void TIM3_IRQHandler(void) {
    if (NULL != timer3_handle) {
        HAL_TIM_IRQHandler(&timer3_handle->hal_timer_handle);
    }
}

void TIM4_IRQHandler(void) {
    if (NULL != timer4_handle) {
        HAL_TIM_IRQHandler(&timer4_handle->hal_timer_handle);
    }
}

void TIM5_IRQHandler(void) {
    if (NULL != timer5_handle) {
        HAL_TIM_IRQHandler(&timer5_handle->hal_timer_handle);
    }
}

void TIM6_DAC_IRQHandler(void) {
    if (NULL != timer6_handle) {
        HAL_TIM_IRQHandler(&timer6_handle->hal_timer_handle);
    }
}

void TIM7_IRQHandler(void) {
    if (NULL != timer7_handle) {
        HAL_TIM_IRQHandler(&timer7_handle->hal_timer_handle);
    }
}

void TIM8_BRK_TIM12_IRQHandler(void) {
    if (NULL != timer8_handle) {
        HAL_TIM_IRQHandler(&timer8_handle->hal_timer_handle);
    }
    if (NULL != timer12_handle) {
        HAL_TIM_IRQHandler(&timer12_handle->hal_timer_handle);
    }
}

void TIM8_UP_TIM13_IRQHandler(void) {
    if (NULL != timer8_handle) {
        HAL_TIM_IRQHandler(&timer8_handle->hal_timer_handle);
    }
    if (NULL != timer13_handle) {
        HAL_TIM_IRQHandler(&timer13_handle->hal_timer_handle);
    }
}

void TIM8_TRG_COM_TIM14_IRQHandler(void) {
    if (NULL != timer8_handle) {
        HAL_TIM_IRQHandler(&timer8_handle->hal_timer_handle);
    }
    if (NULL != timer14_handle) {
        HAL_TIM_IRQHandler(&timer14_handle->hal_timer_handle);
    }
}

void TIM8_CC_IRQHandler(void) {
    if (NULL != timer8_handle) {
        HAL_TIM_IRQHandler(&timer8_handle->hal_timer_handle);
    }
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    mal_timer_s *handle = htim->Parent;
    handle->task_callback(handle->callback_handle);
}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
    // Get input capture handle
    mal_timer_s *handle = htim->Parent;
    mal_timer_input_capture_s *input_capture_handle;
    switch (htim->Channel) {
        case HAL_TIM_ACTIVE_CHANNEL_1:
            input_capture_handle = handle->input_capture_handles[0];
            break;
        case HAL_TIM_ACTIVE_CHANNEL_2:
            input_capture_handle = handle->input_capture_handles[1];
            break;
        case HAL_TIM_ACTIVE_CHANNEL_3:
            input_capture_handle = handle->input_capture_handles[2];
            break;
        case HAL_TIM_ACTIVE_CHANNEL_4:
            input_capture_handle = handle->input_capture_handles[3];
            break;
        default:
            // Should not get here
            return;
    }
    if (NULL == input_capture_handle) {
        return;
    }
    // Execute callback
    input_capture_handle->callback(input_capture_handle->callback_handle, handle->hal_timer_handle.Instance->CNT);
}
